Тест_ЗУП_31_КОРП/src/Enums/УчетНачисленийВСреднемЗаработкеОбщий/УчетНачисленийВСреднемЗаработкеОбщий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетНачисленийВСреднемЗаработкеОбщий</name>
  <enumValues>
    <name>ОбщийЗаработок</name>
  </enumValues>
  <enumValues>
    <name>ПремияФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПремияПроцентом</name>
  </enumValues>
  <enumValues>
    <name>ПремияГодоваяФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПремияГодоваяПроцентом</name>
  </enumValues>
  <enumValues>
    <name>НеВключать</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/УчетНачисленийВСреднемЗаработкеОбщий/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТолькоПремия = Ложь;
	
	СтандартнаяОбработка = Ложь;
	Если Параметры.Свойство("ТолькоПремия") Тогда
		ТолькоПремия = Параметры.ТолькоПремия;
	КонецЕсли;
	
	ДанныеВыбора = Новый СписокЗначений;
	// Добавляем общий заработок, если нет отбора.
	Если Не ТолькоПремия Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок"));		
	КонецЕсли;
	// Заполняем премиями в любом случае.
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой"));

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеВыбора, Премии);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Премии() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой"));
	
	Возврат Премии;
	
КонецФункции

Функция ГодовыеПремии() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой"));
	
	Возврат Премии;
	
КонецФункции

Функция ПремииПроцентом() Экспорт
	
	Премии = Новый Массив;
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом"));
	Премии.Добавить(ПредопределенноеЗначение("Перечисление.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом"));
	
	Возврат Премии;
	
КонецФункции

#КонецОбласти

#КонецЕсли
